dunder_miff_review/app/views/dogs/index.html.erb

SELECT COUNT(*) FROM "employees" WHERE "employees"."dog_id" = ?  [["dog_id", 6]]
---
<% @dogs.each do |dog| %>
  <p><%= link_to dog.name, dog_path(dog) %> - <%= dog.employees.count %></p>