dunder_miff_review/app/views/dogs/show.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."dog_id" = ?  [["dog_id", 2]]
---
  <ul>
    <% @dog.employees.each do |employee| %>