dunder_miff_review/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    if flash[:sorted]
      @dogs = Dog.sorted
    else
      @dogs = Dog.all

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @dog = Dog.find(params[:id])