dunder_miff_review/app/controllers/employees_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def new
    @employee = Employee.new
    @dogs = Dog.all

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "dogs".* FROM "dogs"
---
  def edit
    @employee = Employee.find(params[:id])
    @dogs = Dog.all

INSERT INTO "employees" ("first_name", "last_name", "alias", "office", "dog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "Mose"], ["last_name", "Mose"], ["alias", "Mose"], ["office", "None"], ["dog_id", 1], ["created_at", "2020-06-11 20:48:22.427106"], ["updated_at", "2020-06-11 20:48:22.427106"]]
---
  def create
    employee = Employee.new(employee_params)
    if employee.valid?
      employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "employees" SET "alias" = ?, "title" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["alias", "Big D"], ["title", "Senior Warehouse Assistant"], ["updated_at", "2020-06-11 21:33:27.793263"], ["id", 25]]
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)